{
    "blogs": [
        {
            "title": "Wee Things",
            "body": "The scene is total chaos: a woman and all her purse's contents in middair as she trips over a child's toy, a man hastily trying to gather his spilled laundry, a screaming child weaving through the crowd. Somewhere, in the midst of it all, is the person you've been looking for: wearing a red and white striped shirt, black rimmed glasses and a lopsided cap. There he is! There's Waldo.Many of us have fond memories of Waldo. But while he looms large in our imagination, our childhood searches for Waldo typically stayed pretty small – Waldo is a tiny person in the middle of lots of other tiny things.            And that's what this post is about: wee things. Specifically, the wee things that we see as part of graphics, maps, visualizations (wee things in space) as well as the wee things we experience as part of interactions, navigation, and usability (wee things in time). This means everything from sequences of small graphics that help us make comparisons, to tiny locator maps that help orient us within a larger graphic, to navigation icons that give hints about how we should make our way around a page.Waldo, and the eternal search for him, can actually tell us quite a lot about design. In many ways, Waldo is a great example of what NOT to do when using wee things in your own work. So with Waldo as our anti-hero, let's take a look at how people read and interpret small visual forms, why tiny details can be hugely useful, and what principles we can apply to make all these little images and moments work for us as designers.",
            "author": "Rohan",
            "id": 1
        },
        {
            "title": "Earthquake",
            "body": "hen the 2011 earthquake and tsunami struck Tohoku, Japan, Chris Goldfinger was two hundred miles away, in the city of Kashiwa, at an international meeting on seismology. As the shaking started, everyone in the room began to laugh. Earthquakes are common in Japan—that one was the third of the week—and the participants were, after all, at a seismology conference. Then everyone in the room checked the time.Seismologists know that how long an earthquake lasts is a decent proxy for its magnitude. The 1989 earthquake in Loma Prieta, California, which killed sixty-three people and caused six billion dollars’ worth of damage, lasted about fifteen seconds and had a magnitude of 6.9. A thirty-second earthquake generally has a magnitude in the mid-sevens. A minute-long quake is in the high sevens, a two-minute quake has entered the eights, and a three-minute quake is in the high eights. By four minutes, an earthquake has hit magnitude 9.0.When Goldfinger looked at his watch, it was quarter to three. The conference was wrapping up for the day. He was thinking about sushi. The speaker at the lectern was wondering if he should carry on with his talk. The earthquake was not particularly strong. Then it ticked past the sixty-second mark, making it longer than the others that week. The shaking intensified. The seats in the conference room were small plastic desks with wheels. Goldfinger, who is tall and solidly built, thought, No way am I crouching under one of those for cover. At a minute and a half, everyone in the room got up and went outside.It was March. There was a chill in the air, and snow flurries, but no snow on the ground. Nor, from the feel of it, was there ground on the ground. The earth snapped and popped and rippled. It was, Goldfinger thought, like driving through rocky terrain in a vehicle with no shocks, if both the vehicle and the terrain were also on a raft in high seas. The quake passed the two-minute mark. The trees, still hung with the previous autumn’s dead leaves, were making a strange rattling sound. The flagpole atop the building he and his colleagues had just vacated was whipping through an arc of forty degrees. The building itself was base-isolated, a seismic-safety technology in which the body of a structure rests on movable bearings rather than directly on its foundation. Goldfinger lurched over to take a look. The base was lurching, too, back and forth a foot at a time, digging a trench in the yard. He thought better of it, and lurched away. His watch swept past the three-minute mark and kept going.",
            "author": "Salman",
            "id": 2
        }
    ]
}